<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<html>
<body>
	<h2>여러 페이지 합치기</h2>
	<hr/>
	웹 어플리케이션을 만들어내서 페이지를 구성하다 보면,
	<br/>
	여러페이지에서 다 공통적으로 사용되는 부분들이 있을수 있다. 
	<br/>
	그럼 , 모든 페이지에다가 다 똑같은 구현을 해야지만 해결이 될까..?
	혹은, 공통적으로 사용되야 되는 부분을 만들어두고 여러 곳에서 땡겨다 합쳐서 사용할수 있을까..?
	
	<br/>
	물론 매 페이지마다 구현을 해도 되지만,   
	다른 페이지를 합쳐서 하나로 보이게 하는 방법이 있다 . 페이지 include 
	<hr/>
	페이지 합쳐지는 방식이 두가지가 존재한다 ,  
			정적 include . -  (고정적)     
			 		vs
			동적 include . -  (유동적)
	<hr/>
	차이도 존재한다.
	
	
</body>
</html>





