<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<html>
<body>
	<h2>웹 프로그램 흐름 제어</h2>
	
	게시판 서비스 같은 건 웹프로그램에 거의 제공하고 잇는데,
	글목록을 확인하는 페이지를 있고,
	글 등록을 할수 있는 폼 페이지도 있을꺼고,
	폼에서 전달받을 내용을 DB에 집어넣는 작업을 하는 페이지도 있을꺼고,
	
	<hr/>
	글쓰기 폼에서   ->   글 등록처리 되는 페이지로 submit 이 일어나고 난 뒤에
	처리하는 곳에서
	성공적으로 작업이 진행되면 글목록 페이지로 이동이 되고,
	실패가 일어나면 다시한번 글쓰기 페이지로 이동이 되게 처리해두는데
	
	<hr/>.....
	그런것들을(페이지 이동/ 무빙) 가능하게 해보자.
	<hr/>
	페이지 이동되는 방식이 2가지가 있다.
	(리다이렉트  ,   포워드   ) 방식  .. 차이도 있고, 써야되는 상황도 다르고
	
	
	
	
	
</body>
</html>



